## Tasks

In [64]:
import pandas as pd

### Task 1: Load Dataset & Initial Inspection

In [65]:
df = pd.read_csv("./data/employee_data_raw.csv")

In [66]:
df

   EmpID    Name     Age Gender Department   Salary  Experience    JoinDate
0    101    Amit      25      M         IT  50000.0         2.0  2019-06-12
1    102    Neha     NaN      F         HR  45000.0         3.0  2020-01-15
2    103    Ravi      28      M         IT  50000.0         3.0  2018-09-10
3    104   Pooja      30      F    Finance      NaN         5.0  2017-03-25
4    105   Karan      27      M         IT  52000.0         2.0  2019-06-12
5    105   Karan      27      M         IT  52000.0         2.0  2019-06-12
6    106  Anjali      29      F         HR  48000.0         NaN  2021-07-19
7    107   Sunil  thirty      M    Finance  60000.0         7.0  2016-11-05
8    108   Meena      26      F        NaN  47000.0         2.0  2020-08-30

In [67]:
df.head()

   EmpID   Name  Age Gender Department   Salary  Experience    JoinDate
0    101   Amit   25      M         IT  50000.0         2.0  2019-06-12
1    102   Neha  NaN      F         HR  45000.0         3.0  2020-01-15
2    103   Ravi   28      M         IT  50000.0         3.0  2018-09-10
3    104  Pooja   30      F    Finance      NaN         5.0  2017-03-25
4    105  Karan   27      M         IT  52000.0         2.0  2019-06-12

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       9 non-null      int64
 1   Name        9 non-null      object
 2   Age         8 non-null      object
 3   Gender      9 non-null      object
 4   Department  8 non-null      object
 5   Salary      8 non-null      float64
 6   Experience  8 non-null      float64
 7   JoinDate    9 non-null      object
dtypes: float64(2), int64(1), object(5)
memory usage: 708.0+ bytes

In [69]:
df.describe()

            EmpID        Salary  Experience
count    9.000000      8.000000    8.000000
mean   104.555556  50500.000000    3.250000
std      2.297341   4535.573676    1.832251
min    101.000000  45000.000000    2.000000
25%    103.000000  47750.000000    2.000000
50%    105.000000  50000.000000    2.500000
75%    106.000000  52000.000000    3.500000
max    108.000000  60000.000000    7.000000

In [70]:
# There are few missing values in Age, Salary, Experience and Department
# Duplicate employee record
# Age column has invalid string value "thirty"
# data type of JoinDate is not datetime

### Task 2: Handling Missing Values

#### 2.1 Identify Missing Values

In [71]:
df.isnull().sum()

EmpID         0
Name          0
Age           1
Gender        0
Department    1
Salary        1
Experience    1
JoinDate      0
dtype: int64

#### 2.2 Handle Missing Numerical Values

In [72]:
# Replace missing Age with mean
# Replace missing Salary with median
# Replace missing Experience with median

In [73]:
df["Age"] = pd.to_numeric(df["Age"], errors="coerce")

df['Age'] = df["Age"].fillna(df["Age"].mean())
df["Salary"] = df["Salary"].fillna(df["Salary"].median())
df["Experience"] = df["Experience"].fillna(df["Experience"].median())

#### 2.3 Handle Missing Categorical Values

In [74]:
df['Department'] =  df["Department"].fillna("Unknown")

### Task 3: Removing Duplicate Records

In [75]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
dtype: bool

In [76]:
df.drop_duplicates(inplace=True)

# Duplicate records can bias analysis and ML models.

### Task 4: Data Type Conversion

In [77]:
df["JoinDate"] = pd.to_datetime(df["JoinDate"])

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 8
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       8 non-null      int64
 1   Name        8 non-null      object
 2   Age         8 non-null      float64
 3   Gender      8 non-null      object
 4   Department  8 non-null      object
 5   Salary      8 non-null      float64
 6   Experience  8 non-null      float64
 7   JoinDate    8 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(1), object(3)
memory usage: 576.0+ bytes

### Task 5: Column Renaming & Standardization

In [79]:
df.rename(columns={
    "EmpID": "employee_id",
    "Name": "name",
    "Age": "age",
    "Gender": "gender",
    "Department": "department",
    "Salary": "salary",
    "Experience": "experience_years",
    "JoinDate": "join_date"
}, inplace=True)

### Task 6: Final Cleaned Dataset Review

In [80]:
df.head()

,employee_id,name,age,gender,department,salary,experience_years,join_date
0,101,Amit,25.000000,M,IT,50000.0,2.0,2019-06-12
1,102,Neha,27.428571,F,HR,45000.0,3.0,2020-01-15
2,103,Ravi,28.000000,M,IT,50000.0,3.0,2018-09-10
3,104,Pooja,30.000000,F,Finance,50000.0,5.0,2017-03-25
4,105,Karan,27.000000,M,IT,52000.0,2.0,2019-06-12

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 8
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       8 non-null      int64
 1   name              8 non-null      object
 2   age               8 non-null      float64
 3   gender            8 non-null      object
 4   department        8 non-null      object
 5   salary            8 non-null      float64
 6   experience_years  8 non-null      float64
 7   join_date         8 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(1), object(3)
memory usage: 576.0+ bytes

In [82]:
df.describe()

,employee_id,age,salary,experience_years,join_date
count,8.00000,8.000000,8.000000,8.000000,8
mean,104.50000,27.482143,50250.000000,3.312500,2019-03-28 15:00:00
min,101.00000,25.000000,45000.000000,2.000000,2016-11-05 00:00:00
25%,102.75000,26.750000,47750.000000,2.000000,2018-04-29 12:00:00
50%,104.50000,27.428571,50000.000000,2.750000,2019-06-12 00:00:00
75%,106.25000,28.250000,50500.000000,3.500000,2020-03-12 00:00:00
max,108.00000,30.000000,60000.000000,7.000000,2021-07-19 00:00:00
std,2.44949,1.581485,4496.029995,1.791597,NaN

In [83]:
df.to_csv("./data/employee_data_cleaned.csv", index=False)